loadtest/scenarios.yml
# Artillery 부하 시나리오 — FE 동접 200-300명 시뮬레이션.
#
# 실행:
#   npm run loadtest             # localhost:3000 (dev) 기본
#   TARGET=https://... npm run loadtest          # 운영/preview
#   npm run loadtest:report      # JSON 출력 + HTML 리포트
#
# 측정 목표:
#   - Vercel Image Optimization 실 변환 호출 수 (dashboard 함께 모니터)
#   - 핵심 endpoint p95 latency
#   - middleware (인증 가드) 처리 시간
#   - /_next/image cache hit ratio
#
# 시나리오 가중치는 사용자 흐름 기반 추정 — 운영 GA 가 들어오면 실측으로 보정.

config:
  target: '{{ $processEnvironment.TARGET || "http://localhost:3000" }}'

  # 단계: warm-up → 정상 부하 → 피크 부하 → 쿨다운
  phases:
    - duration: 60
      arrivalRate: 5
      rampTo: 20
      name: 'Warm-up (60s)'
    - duration: 180
      arrivalRate: 20
      rampTo: 30
      name: '정상 부하 (3min)'
    - duration: 120
      arrivalRate: 30
      rampTo: 50
      name: '피크 (2min, 동접 ~250 시뮬레이션)'
    - duration: 60
      arrivalRate: 20
      rampTo: 5
      name: '쿨다운'

  # think 시간 평균 4-5초 + arrivalRate 50/s → 동접 ≈ 200-250 (Little's Law)
  defaults:
    headers:
      User-Agent: 'artillery-loadtest'
      Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,*/*;q=0.8'
      Accept-Language: 'ko-KR,ko;q=0.9,en;q=0.8'

  # latency 임계치 — 운영 SLO 기준 (모바일 4G 환경 기준 약간 여유)
  ensure:
    p95: 1000 # 95th percentile 1초 이하
    p99: 2500 # 99th percentile 2.5초 이하
    maxErrorRate: 1 # 에러율 1% 이하

scenarios:
  # 사용자가 가장 자주 진입하는 path. 가중치 = 시나리오 선택 확률.
  - name: 'Home → Region browse'
    weight: 35
    flow:
      - get:
          url: '/'
      - think: 4
      - get:
          url: '/region'
      - think: 3
      - get:
          url: '/region/cheongju'
      - think: 6 # 카드 grid 스크롤
      - get:
          url: '/region/danyang'

  - name: 'Tournament 시작 흐름'
    weight: 25
    flow:
      - get:
          url: '/'
      - think: 3
      - get:
          url: '/tournament'
      - think: 5
      - get:
          url: '/tournament/play'

  - name: 'Quiz 시작 흐름'
    weight: 15
    flow:
      - get:
          url: '/'
      - think: 3
      - get:
          url: '/quiz'

  - name: 'Letter 탐색'
    weight: 10
    flow:
      - get:
          url: '/letter'
      - think: 5
      - get:
          url: '/letter/sent'

  - name: 'Ranking 탐색'
    weight: 10
    flow:
      - get:
          url: '/ranking'

  - name: 'MyPage'
    weight: 5
    flow:
      - get:
          url: '/mypage'